#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3_read will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_read"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "1"
        }
    }

  # aws_iam_policy.s3_read_access will be created
  + resource "aws_iam_policy" "s3_read_access" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "s3_read_access"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3_read_access_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "s3_read_access_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "awesome-role"
    }

  # module.iam.data.aws_iam_policy_document.policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "awesome-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "awesome-user"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.s3.module.s3.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "awesome-random-bucket-123"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.s3.module.s3.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @bmbferreira, Action: `pull_request`, Working Directory: `terraform/dev`, Workflow: `Awesome Terraform Workflow`*